Revit 2026 API

# SolidOrShellTessellationControlsMinExternalAngleBetweenTriangles Property

---

A positive real number specifying the minimum allowed value for the external angle between two adjacent triangles, in radians.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MinExternalAngleBetweenTriangles { get; set; }
```
```vb
Public Property MinExternalAngleBetweenTriangles As Double
	Get
	Set
```
```cpp
public:
property double MinExternalAngleBetweenTriangles {
	double get ();
	void set (double value);
}
```
```fsharp
member MinExternalAngleBetweenTriangles : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for minExternalAngleBetweenTriangles must be greater than 0 and no more than 30000 feet. |

A small value yields more smoothly curved triangulated surfaces, usually at the expense of an increase in the number of triangles. Note that this setting has no effect for planar surfaces. This constraint may be approximately enforced.

#### Reference

SolidOrShellTessellationControls Class

Autodesk.Revit.DB Namespace